In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [4]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [9]:
df.sum(axis=1) # it count the sum of each rows.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [17]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [20]:
df.idxmin() # it will return the index which contains the minimum value.

one    d
two    b
dtype: object

In [21]:
df.idxmax() # it will return the index which contains the maximum value.

one    b
two    d
dtype: object

In [22]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [25]:
df.describe() # to produce multiple summary statistic in one shot.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [30]:
obj = pd.Series(['a', 'a', 'b', 'c'] *4)

In [31]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [32]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance

In [40]:
# import pandas_datareader.data as web

In [41]:
# all_data = {ticker: web.get_data_yahoo(ticker)
#            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
# price = pd.DataFrame({ticker: data['Adj Close']
#                      for ticker, data in all_data.items()})
# volume = pd.DataFrame({ticker: data['volume']
#                       for ticker, data in all_data.items()})

## Data not available for the above particular data! in future we will understand using another data

## Unique Values, Values Count, and Membership

In [42]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [43]:
uniques = obj.unique()

In [44]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [46]:
obj.value_counts() # we can count occurance of obj's series.

c    3
a    3
b    2
d    1
dtype: int64

In [49]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
d    1
b    2
dtype: int64

In [50]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [51]:
mask = obj.isin(['b', 'c'])

In [52]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [53]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [54]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [55]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [56]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [57]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [58]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [59]:
result = data.apply(pd.value_counts).fillna(0)

In [60]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0